app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."permalink" = 'sup') LIMIT 1
---
  def create
    @post = Post.find_by_permalink(params[:post_id])