app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    @comment.author = Author.find(2)
    @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "authors" WHERE ("authors"."id" = 2)
INSERT INTO "comments" ("updated_at", "body", "post_id", "author_id", "created_at") VALUES('2009-03-02 21:28:24', 'Yo', 1, NULL, '2009-03-02 21:28:24')