app/controllers/posts_controller.rb

  def index
    @posts = Post.find(:all)
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)

  def show
    @post = Post.find_by_permalink(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."permalink" = 'hmmm') LIMIT 1

  def edit
    @post = Post.find_by_permalink(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."permalink" = 'hmmm') LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.owner = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("permalink", "updated_at", "title", "body", "user_id", "created_at") VALUES('test', '2009-03-03 01:09:53', 'Test', 'yo', 1, '2009-03-03 01:09:53')

  def update
    @post = Post.find_by_permalink(params[:id])

    respond_to do |format|
      @post.attributes = params[:post]
      if @post.save_with_user(current_user)
---
SELECT * FROM "posts" WHERE ("posts"."permalink" = 'well') LIMIT 1
UPDATE "posts" SET "body" = 'I''m starting to get Rails.