app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('04ffc07cbcdb22beea64228b4c78e7ce78906be8', '2009-03-02 22:11:25', '378fc25a543ce9233aeab324488ee97bb241dce2', NULL, NULL, 'bonasaurus1', 'bonasaurus1@gmail.com', '2009-03-02 22:11:25')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save